IW.orig/damBreak/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    atmosphere
    {
        type            patch;
        nFaces          105;
        startFace       26015;
    }
    walls
    {
        type            wall;
        nFaces          275;
        startFace       26120;
    }
    defaultFaces
    {
        type            empty;
        nFaces          34940;
        startFace       26395;
    }
)

// ************************************************************************* //
